#ifndef FEATURE_H
#define FEATURE_H

#include <vector>

#include "opencv2/core/core.hpp"

class Feature {

public:

    cv::Mat image;                  // Исходный кадр
    cv::Rect roi;                   // Область патча в исходном кадре
    cv::Mat pos;                    // Центр патча в мировой системе координат
    cv::Mat normal;                 // Вектор нормали патча в мировой системе координат
    cv::Mat R;                      // Поворот камеры в исходном кадре из мира в камеру
    cv::Mat t;                      // Положение камеры в исходном кадре в мировой системе координат

    cv::Mat P;                      // Ковариационная матрица состояния признака: его положения

    int matchingFails;              // Сколько раз признак не удалось сопоставить
    int matchingAttempts;           // Количество попыток сопоставления

    cv::Mat dir;                    // Единичный вектор луча признака в мировой системе координат
    std::vector<double> depths;     // Гипотезы глубины признака
    std::vector<double> probs;      // Вероятности гипотез

    /*
     * Конструктор полностью инициализированного признака. Это вспомогательный
     * метод для этапа инициализации карты, когда вручную добавленные признаки
     * считаются известными без неопределённости положения.
     *
     * image    Кадр камеры в момент инициализации признака
     * roi      Патч признака
     * normal   Вектор нормали патча
     * R        Поворот камеры из мира в камеру при инициализации признака
     * t        Положение камеры в мировой системе координат при инициализации
     */
    Feature(const cv::Mat& image, const cv::Rect& roi, const cv::Mat& normal,
            const cv::Mat& R, const cv::Mat& t);

    /*
     * Конструктор предварительно инициализированного признака-кандидата.
     *
     * image            Кадр камеры в момент инициализации признака
     * roi              Патч признака
     * R                Поворот камеры из мира в камеру при инициализации
     * t                Положение камеры в мировой системе координат при инициализации
     * dir              Единичный вектор луча признака в мировой системе координат
     * depthInterval    Интервал, содержащий гипотезы глубины
     * depthSamples     Количество гипотез глубины
     */
    Feature(const cv::Mat& image, const cv::Rect& roi, const cv::Mat& R, const cv::Mat& t,
            const cv::Mat& dir, const cv::Point2d& depthInterval, int depthSamples);
};

#endif
