#ifndef UTIL_H
#define UTIL_H

#include "opencv2/core/core.hpp"

constexpr double PI         = 3.1415926535897932385;
constexpr double PI_DOUBLE  = 6.2831853071795864769;
constexpr double RAD_TO_DEG = 57.295779513082320877;
constexpr double DEG_TO_RAD = 0.0174532925199432957;

/*
 * Считает матрицу гомографии H между двумя видами плоскости для камеры-обскуры.
 * В частности, p2 = H * p1, где p1 — пиксель в первом виде, соответствующий
 * точке p на плоскости, а p2 — пиксель этой же точки во втором виде.
 *
 * p    Точка на плоскости в мировой системе координат
 * n    Нормаль плоскости в мировой системе координат
 * K    Матрица внутренних параметров камеры
 * R1   Поворот первой позы из мира в камеру
 * t1   Положение первой камеры в мировой системе координат
 * R2   Поворот второй позы из мира в камеру
 * t2   Положение второй камеры в мировой системе координат
 */
cv::Mat computeHomography(const cv::Mat& p, const cv::Mat& n, const cv::Mat& K,
                          const cv::Mat& R1, const cv::Mat& t1, const cv::Mat& R2, const cv::Mat& t2);

/*
 * Возвращает квадратную область интереса по пиксельным координатам центра
 * и размеру. Квадрат будет точно центрирован в нужной точке только при
 * нечётном размере.
 *
 * center       Центр квадрата
 * size         Размер квадрата
 */
cv::Rect buildSquare(const cv::Point2i& center, int size);

/*
 * Удаляет n-ю строку и n-й столбец квадратной матрицы. Исходная матрица
 * не меняется, возвращается глубокая копия.
 *
 * mat      Матрица, которую нужно уменьшить
 * idx      Удаляемые строка и столбец
 */
cv::Mat removeRowCol(const cv::Mat& mat, int idx);

/*
 * Удаляет заданные строки и столбцы квадратной матрицы. Исходная матрица
 * не меняется, возвращается глубокая копия. Индексы для удаления должны
 * быть отсортированы по возрастанию. Параметр stride показывает, как строки
 * и столбцы группируются и соотносятся с индексами. Например, для индексов
 * 0, 3, 7 и stride = 2 будут удалены строки и столбцы 0, 1, 6, 7, 14, 15.
 *
 * mat          Матрица, которую нужно уменьшить
 * indices      Отсортированные строки и столбцы для удаления
 * stride       Шаг группировки строк и столбцов
 */
cv::Mat removeRowsCols(const cv::Mat& mat, std::vector<int>& indices, int stride = 1);

/*
 * Удаляет n-ю строку матрицы. Исходная матрица не меняется,
 * возвращается глубокая копия.
 *
 * mat      Матрица, которую нужно уменьшить
 * idx      Удаляемая строка
 */
cv::Mat removeRow(const cv::Mat& mat, int idx);

/*
 * Удаляет заданные строки матрицы. Исходная матрица не меняется,
 * возвращается глубокая копия. Индексы для удаления должны быть
 * отсортированы по возрастанию. Параметр stride показывает, как строки
 * группируются и соотносятся с индексами. Например, для индексов
 * 0, 3, 7 и stride = 2 будут удалены строки 0, 1, 6, 7, 14, 15.
 *
 * mat          Матрица, которую нужно уменьшить
 * indices      Отсортированные строки для удаления
 * stride       Шаг группировки строк
 */
cv::Mat removeRows(const cv::Mat& mat, std::vector<int>& indices, int stride = 1);

/*
 * Удаляет заданные элементы вектора. Вектор уменьшается на месте.
 * Индексы удаляемых элементов должны быть отсортированы по возрастанию.
 *
 * vec          Вектор, который нужно уменьшить
 * indices      Отсортированные индексы удаляемых элементов
 */
template <class T>
void removeIndices(std::vector<T>& vec, const std::vector<int>& indices) {

    for (int i = indices.size() - 1; i >= 0; i--)
        vec.erase(vec.begin() + indices[i]);
}

/*
 * Возвращает эллипсы, внутри которых с высокой вероятностью должны находиться
 * предсказанные видимые признаки. Эллипсы строятся как доверительные области
 * уровня 0.86.
 *
 * means    Предсказанные пиксельные положения видимых признаков
 * S        Ковариационная матрица инновации для предсказанных видимых признаков
 */
std::vector<cv::RotatedRect> computeEllipses(const std::vector<cv::Point2d>& means, const cv::Mat& S);

/*
 * Возвращает минимальный прямой прямоугольник, содержащий заданный эллипс.
 * Если прямоугольник выходит за границы изображения, он обрезается.
 *
 * ellipse      Эллипс, для которого ищется ограничивающий прямоугольник
 * imageSize    Размер изображения
 */
cv::Rect getBoundingBox(const cv::RotatedRect& ellipse, const cv::Size& imageSize);

/*
 * Рисует прямоугольник на изображении. Функция меняет изображение,
 * поэтому для сохранения оригинала нужно заранее сделать глубокую копию.
 *
 * image        Серое или цветное изображение для рисования
 * rectangle    Прямоугольник
 * color        Цвет прямоугольника
 */
void drawRectangle(cv::Mat& image, const cv::Rect& rectangle, const cv::Scalar& color);

/*
 * Рисует квадрат на изображении. Функция меняет изображение,
 * поэтому для сохранения оригинала нужно заранее сделать глубокую копию.
 *
 * image        Серое или цветное изображение для рисования
 * center       Центр квадрата
 * width        Ширина квадрата
 * color        Цвет квадрата
 */
void drawSquare(cv::Mat& image, const cv::Point2i& center, int width, const cv::Scalar& color);

/*
 * Рисует эллипс на изображении. Функция меняет изображение,
 * поэтому для сохранения оригинала нужно заранее сделать глубокую копию.
 *
 * image        Серое или цветное изображение для рисования
 * ellipse      Эллипс
 * color        Цвет эллипса
 */
void drawEllipse(cv::Mat& image, const cv::RotatedRect& ellipse, const cv::Scalar& color);

/*
 * Рисует окружность на изображении. Функция меняет изображение,
 * поэтому для сохранения оригинала нужно заранее сделать глубокую копию.
 *
 * image        Серое или цветное изображение для рисования
 * center       Центр окружности
 * radius       Радиус окружности
 * color        Цвет окружности
 */
void drawCircle(cv::Mat& image, const cv::Point2i& center, int radius, const cv::Scalar& color);

void drawTemplate(cv::Mat& image, const cv::Mat& templ, const cv::Point2d& position, int cx, int cy);

#endif
